//! Create React App을 이용한 리액트 설치
// npx create-react-app 명령어로 간단하게 설치가능하다.
// 요즘엔 바벨(babel), 웹팩(webpack) 같은 모듈도 한번에 설치되므로 번거로운 과정이 없어졌다.

// 웹팩(Webpack)이란? 
// 오픈 소스 자바스크립트 모듈 번들러. 여러개로 나누어져 있는 파일들을 하나의 자바스크립트 코드로 압축하고 최적화하는 라이브러리
// 장점 1 : 여러 파일 내 JS코드들을 압축하여 최적화 하기때문에 로딩에 대한 네트워크 비용을 줄일수 있다.
// 장점 2 : 모듈 단위로 개발이 가능하며, 가독성과 유지보수가 쉽다.

// 바벨(Babel)이란?
// 최신 JS문법을 지원하지 않는 브라우저들을 위해 하위호환 가능하도록 코드를 변환해주는 라이브러리

// npx란?
// npx는 노드 패키지 실행을 도와주는 도구이다. 무수히 많은 npm 레지스트리들 중 해당 패키지를 실행하여 리액트를 설치해주는 것.

// 리액트는 수많은 컴포넌트(Component)들이 조립되어 페이지를 이루는 방식이다.
// 컴포넌트는 함수형, 클래스형 2가지로 작성할 수 있다.

// 설치
// $ npx create-react-app ./ 

// 실행
// $ npm run start
// $ npm start

